app/views/tasks/create.js.erb

INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "feefef"], ["created_at", "2016-08-19 03:22:35.597953"], ["updated_at", "2016-08-19 03:22:35.597953"]]
---
  // move task according to priority
  $("#tasks>form").each(function(){
    if ($(this).children('input#task_complete:checked').length > 0) {

      $('#edit_task_<%= @task.id %>').insertBefore($(this));
      return false;
    }

    if (parseInt($(this).attr('id').substr(10,2)) == <%= @task.id %>) {
      return false;
    }

    var form_task_priority = parseInt($(this).data("priority"));
    var updated_priority = <%= @task.priority %>;

    if (form_task_priority <= updated_priority) {
      $('#edit_task_<%= @task.id %>').insertBefore($(this));
      return false
    }
  });