app/views/dates/show.html.erb

  <div class="col-md-6">
    <p>To-do (<span id="task-num"><%= @incompleted_tasks.count %></span>/6)</p>
---
SELECT "tasks".* FROM "tasks" WHERE ("tasks"."created_at" BETWEEN '2016-08-19 00:00:00.000000' AND '2016-08-19 23:59:59.999999' OR "tasks"."complete" = 'f')