app/controllers/tasks_controller.rb

SELECT COUNT(*) FROM "tasks" WHERE ("tasks"."created_at" BETWEEN '2016-08-19 00:00:00.000000' AND '2016-08-19 23:59:59.999999' AND "tasks"."complete" = 't' OR "tasks"."complete" = 'f')
INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "efe"], ["created_at", "2016-08-19 03:22:05.341324"], ["updated_at", "2016-08-19 03:22:05.341324"]]
---
  def create
    respond_to do |format|
      format.js {
        if Task.uncompleted.count < 6
          @task = Task.create!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 26]]
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["complete", "t"], ["updated_at", "2016-08-19 04:41:17.583916"], ["id", 30]]
---
  def update
    @task = Task.find(params[:id])
    @task.update_attributes!(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    @task = Task.destroy(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 20]]
---
  def up
    @task = Task.find(params[:task_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 21]]
---
  def down
    @task = Task.find(params[:task_id])